---
kind: other
id: Properties.T:Autodesk.Revit.DB.BRepBuilderSurfaceGeometry
source: html/357872e1-a788-45b1-e74d-c54891f076bd.htm
---
# BRepBuilderSurfaceGeometry Properties

Specifies whether the .NET object represents a valid Revit entity.